experimental/glm52_b300_fixed_seq/results/c2-three-arm-dp-mem80-20260920/runs/c2-w4a16-cutedsl-mem80-20260920/1k1k/w4a16-cutedsl/tp4_conc64/benchmark.log
+ run_server_client env PYTHONPATH=/data/home/ziangli/inferencex-glm52-b300/sources/inferencex-cutedsl-20260920:/data/home/ziangli/inferencex-glm52-b300/sources/sglang/python:/data/home/ziangli/inferencex-glm52-b300/sources/flashinfer-f9dd3c10:/data/home/ziangli/inferencex-glm52-b300/sources/inferencex-cutedsl-20260920 python3 -m infx.bench_serving.benchmark_serving --model nvidia/GLM-5.2-NVFP4 --backend vllm --base-url http://0.0.0.0:30000 --dataset-name random --random-input-len 1024 --random-output-len 1024 --random-range-ratio 0.8 --num-prompts 640 --max-concurrency 64 --request-rate inf --ignore-eos --save-result --num-warmups 128 --percentile-metrics ttft,tpot,itl,e2el --result-dir /data/home/ziangli/inferencex-glm52-b300/results/c2-w4a16-cutedsl-mem80-20260920/1k1k/w4a16-cutedsl/tp4_conc64 --result-filename result.json --use-chat-template --tokenizer /data/home/ziangli/inferencex-glm52-b300/checkpoints/GLM-5.2-NVFP4
+ [[ -n /tmp/inferencex-server-state.yX44Js ]]
+ PYTHONPATH=/data/home/ziangli/inferencex-glm52-b300/sources/inferencex-cutedsl-20260920:/data/home/ziangli/inferencex-glm52-b300/sources/sglang/python:/data/home/ziangli/inferencex-glm52-b300/sources/flashinfer-f9dd3c10:/data/home/ziangli/inferencex-glm52-b300/sources/inferencex-cutedsl-20260920
+ python3 -m infx.bench_serving.server_watch run --state /tmp/inferencex-server-state.yX44Js -- env PYTHONPATH=/data/home/ziangli/inferencex-glm52-b300/sources/inferencex-cutedsl-20260920:/data/home/ziangli/inferencex-glm52-b300/sources/sglang/python:/data/home/ziangli/inferencex-glm52-b300/sources/flashinfer-f9dd3c10:/data/home/ziangli/inferencex-glm52-b300/sources/inferencex-cutedsl-20260920 python3 -m infx.bench_serving.benchmark_serving --model nvidia/GLM-5.2-NVFP4 --backend vllm --base-url http://0.0.0.0:30000 --dataset-name random --random-input-len 1024 --random-output-len 1024 --random-range-ratio 0.8 --num-prompts 640 --max-concurrency 64 --request-rate inf --ignore-eos --save-result --num-warmups 128 --percentile-metrics ttft,tpot,itl,e2el --result-dir /data/home/ziangli/inferencex-glm52-b300/results/c2-w4a16-cutedsl-mem80-20260920/1k1k/w4a16-cutedsl/tp4_conc64 --result-filename result.json --use-chat-template --tokenizer /data/home/ziangli/inferencex-glm52-b300/checkpoints/GLM-5.2-NVFP4
Namespace(backend='vllm', base_url='http://0.0.0.0:30000', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=64, model='nvidia/GLM-5.2-NVFP4', tokenizer='/data/home/ziangli/inferencex-glm52-b300/checkpoints/GLM-5.2-NVFP4', best_of=1, use_beam_search=False, num_prompts=640, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=False, metadata=None, result_dir='/data/home/ziangli/inferencex-glm52-b300/results/c2-w4a16-cutedsl-mem80-20260920/1k1k/w4a16-cutedsl/tp4_conc64', result_filename='result.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='90,99,99.9', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.8, random_prefix_len=0, use_chat_template=True, random_num_workers=0, dsv4=False, hf_subset=None, hf_split=None, hf_output_len=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, num_warmups=128)
Generating 640 prompts using 8 worker processes...
Prompt generation completed in 4.2s
-------------------  Input/Output Length Statistics  -------------------
 input_lens : min=821   max=1024  mean=923.39   avg_token_mismatch=12.00 
 output_lens: min=819   max=1024  mean=921.64  
------------------------------------------------------------------------ 

Starting initial single prompt test run...
Warming up with 128 requests...
100%|██████████| 128/128 [00:24<00:00,  5.32it/s]
Warmup completed.
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 64
  0%|          | 0/640 [00:00<?, ?it/s]Starting main benchmark run...
100%|██████████| 640/640 [03:49<00:00,  2.79it/s]
============ Serving Benchmark Result ============
Successful requests:                     640       
Benchmark duration (s):                  229.06    
Total input tokens:                      590968    
Total generated tokens:                  589849    
Request throughput (req/s):              2.79      
Output token throughput (tok/s):         2575.07   
Total Token throughput (tok/s):          5155.03   
---------------Time to First Token----------------
Mean TTFT (ms):                          1042.74   
Median TTFT (ms):                        538.95    
P90 TTFT (ms):                           2175.36   
P99 TTFT (ms):                           3980.77   
P99.9 TTFT (ms):                         14895.87  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          23.18     
Median TPOT (ms):                        23.70     
P90 TPOT (ms):                           26.99     
P99 TPOT (ms):                           29.87     
P99.9 TPOT (ms):                         31.41     
---------------Inter-token Latency----------------
Mean ITL (ms):                           1884.88   
Median ITL (ms):                         1344.03   
P90 ITL (ms):                            3945.58   
P99 ITL (ms):                            8385.49   
P99.9 ITL (ms):                          13472.51  
----------------End-to-end Latency----------------
Mean E2EL (ms):                          22388.98  
Median E2EL (ms):                        22554.74  
P90 E2EL (ms):                           26540.07  
P99 E2EL (ms):                           30680.96  
P99.9 E2EL (ms):                         41621.48  
==================================================
+ set +x